20230711190102-array.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 10:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Array</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Array</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7bcdfbd">1. Element Insertion</a>
<ul>
<li><a href="#org4ffc250">1.1. Overview</a></li>
<li><a href="#orge740a16">1.2. Insert at End of Array</a>
<ul>
<li><a href="#org6e9cc29">1.2.1. push()</a></li>
<li><a href="#org31c7171">1.2.2. Spread (Immutable)</a></li>
</ul>
</li>
<li><a href="#orgf9fd1d8">1.3. Insert at Beginning of Array</a>
<ul>
<li><a href="#org8c540b9">1.3.1. unshift()</a></li>
<li><a href="#org5cf8fd5">1.3.2. Spread (Immutable)</a></li>
</ul>
</li>
<li><a href="#org7a7dfbf">1.4. Performance Notes</a></li>
<li><a href="#org3dacb44">1.5. Notes</a></li>
</ul>
</li>
<li><a href="#org2b8370c">2. Element Removal</a>
<ul>
<li><a href="#org15f7252">2.1. Overview</a></li>
<li><a href="#orgcda67db">2.2. Remove from End of Array</a>
<ul>
<li><a href="#org9bd99dc">2.2.1. pop()</a></li>
<li><a href="#orgb346b03">2.2.2. Immutable (slice)</a></li>
</ul>
</li>
<li><a href="#orga2f7728">2.3. Remove from Beginning of Array</a>
<ul>
<li><a href="#org6ad8c7f">2.3.1. shift()</a></li>
<li><a href="#org325b0ed">2.3.2. Immutable (slice)</a></li>
</ul>
</li>
<li><a href="#org4631272">2.4. Remove from Middle of Array</a>
<ul>
<li><a href="#org55e1770">2.4.1. splice()</a></li>
<li><a href="#org98e08f1">2.4.2. Immutable (filter)</a></li>
<li><a href="#org98d63de">2.4.3. Immutable (slice + spread)</a></li>
</ul>
</li>
<li><a href="#orga56701f">2.5. Performance Notes</a></li>
<li><a href="#org9883e13">2.6. Notes</a></li>
</ul>
</li>
<li><a href="#orgd76a391">3. Sorting</a>
<ul>
<li><a href="#org8267b57">3.1. Overview</a></li>
<li><a href="#orgf475e4b">3.2. reverse()</a>
<ul>
<li><a href="#orgf885c9a">3.2.1. Immutable (copy + reverse)</a></li>
</ul>
</li>
<li><a href="#orgc06cf62">3.3. sort()</a>
<ul>
<li><a href="#org32e9be2">3.3.1. Numeric sort (ascending)</a></li>
<li><a href="#orgb0a28bd">3.3.2. Numeric sort (descending)</a></li>
<li><a href="#orge077490">3.3.3. String sort</a></li>
<li><a href="#orgd1855df">3.3.4. Immutable (copy + sort)</a></li>
</ul>
</li>
<li><a href="#orgb2d080f">3.4. Performance Notes</a></li>
<li><a href="#org62a2e36">3.5. Notes</a></li>
</ul>
</li>
<li><a href="#orge48418b">4. Iterators</a>
<ul>
<li><a href="#org0d6596b">4.1. Overview</a></li>
<li><a href="#org52ae92e">4.2. forEach()</a></li>
<li><a href="#org69e4c79">4.3. map()</a></li>
<li><a href="#orge8a6143">4.4. filter()</a></li>
<li><a href="#orgc5f5e58">4.5. Chaining Example</a></li>
<li><a href="#org331f2a4">4.6. Performance Notes</a></li>
<li><a href="#org7befc39">4.7. Notes</a></li>
</ul>
</li>
<li><a href="#org70326c5">5. Two-Dimensional Array Iteration</a>
<ul>
<li><a href="#orgd6880ea">5.1. Overview</a></li>
<li><a href="#orgd3cbbc9">5.2. Row-wise Iteration</a></li>
<li><a href="#orgeeaff70">5.3. Column-wise Iteration</a></li>
<li><a href="#org803c891">5.4. Column-wise with forEach</a></li>
<li><a href="#orgb3dc10b">5.5. Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7bcdfbd" class="outline-2">
<h2 id="org7bcdfbd"><span class="section-number-2">1.</span> Element Insertion</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4ffc250" class="outline-3">
<h3 id="org4ffc250"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Ordered collections of values</li>
<li>Zero-indexed</li>
<li><b>Mutable</b> (can be modified in place)</li>
</ul>
</div>
</div>

<div id="outline-container-orge740a16" class="outline-3">
<h3 id="orge740a16"><span class="section-number-3">1.2.</span> Insert at End of Array</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org6e9cc29" class="outline-4">
<h4 id="org6e9cc29"><span class="section-number-4">1.2.1.</span> push()</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Adds one or more elements to the end</li>
<li>Mutates the original array</li>
<li>Returns the new length</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
arr.push(4)
// [1, 2, 3, 4]
</pre>
</div>
</div>
</div>

<div id="outline-container-org31c7171" class="outline-4">
<h4 id="org31c7171"><span class="section-number-4">1.2.2.</span> Spread (Immutable)</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Creates a new array</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
let newArr = [...arr, 4]
// [1, 2, 3, 4]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf9fd1d8" class="outline-3">
<h3 id="orgf9fd1d8"><span class="section-number-3">1.3.</span> Insert at Beginning of Array</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org8c540b9" class="outline-4">
<h4 id="org8c540b9"><span class="section-number-4">1.3.1.</span> unshift()</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>Adds one or more elements to the start</li>
<li>Mutates the original array</li>
<li>Returns the new length</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
arr.unshift(0)
// [0, 1, 2, 3]
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cf8fd5" class="outline-4">
<h4 id="org5cf8fd5"><span class="section-number-4">1.3.2.</span> Spread (Immutable)</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Creates a new array</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
let newArr = [0, ...arr]
// [0, 1, 2, 3]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7a7dfbf" class="outline-3">
<h3 id="org7a7dfbf"><span class="section-number-3">1.4.</span> Performance Notes</h3>
<div class="outline-text-3" id="text-1-4">
<dl class="org-dl">
<dt>push()</dt><dd>O(1)</dd>
<dt>unshift()</dt><dd>O(n)</dd>
</dl>
</div>
</div>

<div id="outline-container-org3dacb44" class="outline-3">
<h3 id="org3dacb44"><span class="section-number-3">1.5.</span> Notes</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Prefer push() for performance-sensitive code</li>
<li>Use spread syntax for <b>immutable</b> <b>updates</b> (e.g., React state)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2b8370c" class="outline-2">
<h2 id="org2b8370c"><span class="section-number-2">2.</span> Element Removal</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org15f7252" class="outline-3">
<h3 id="org15f7252"><span class="section-number-3">2.1.</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Arrays are mutable by default</li>
<li>Elements can be removed from the <b>end</b>, <b>beginning</b>, or <b>middle</b></li>
<li>Removal can be <b>mutable</b> or <b>immutable</b> depending on method</li>
</ul>
</div>
</div>

<div id="outline-container-orgcda67db" class="outline-3">
<h3 id="orgcda67db"><span class="section-number-3">2.2.</span> Remove from End of Array</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org9bd99dc" class="outline-4">
<h4 id="org9bd99dc"><span class="section-number-4">2.2.1.</span> pop()</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>Removes the last element</li>
<li>Mutates the original array</li>
<li>Returns the removed element</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
let removed = arr.pop()
// removed = 3
// arr = [1, 2]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb346b03" class="outline-4">
<h4 id="orgb346b03"><span class="section-number-4">2.2.2.</span> Immutable (slice)</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>Creates a new array without the last element</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
let newArr = arr.slice(0, -1)
// [1, 2]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga2f7728" class="outline-3">
<h3 id="orga2f7728"><span class="section-number-3">2.3.</span> Remove from Beginning of Array</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org6ad8c7f" class="outline-4">
<h4 id="org6ad8c7f"><span class="section-number-4">2.3.1.</span> shift()</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>Removes the first element</li>
<li>Mutates the original array</li>
<li>Returns the removed element</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
let removed = arr.shift()
// removed = 1
// arr = [2, 3]
</pre>
</div>
</div>
</div>

<div id="outline-container-org325b0ed" class="outline-4">
<h4 id="org325b0ed"><span class="section-number-4">2.3.2.</span> Immutable (slice)</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>Creates a new array without the first element</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
let newArr = arr.slice(1)
// [2, 3]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4631272" class="outline-3">
<h3 id="org4631272"><span class="section-number-3">2.4.</span> Remove from Middle of Array</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org55e1770" class="outline-4">
<h4 id="org55e1770"><span class="section-number-4">2.4.1.</span> splice()</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>Removes elements at a specific index</li>
<li>Mutates the original array</li>
<li>Syntax: splice(startIndex, deleteCount)
<ul class="org-ul">
<li>startIndex (Inclusive)</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3, 4]
arr.splice(1, 2)
// arr = [1, 4]

//           0  1  2  3  4
const arr = [4,23,14,55,23]

console.log(arr.splice(2, 2)) // 14, 55
</pre>
</div>
</div>
</div>

<div id="outline-container-org98e08f1" class="outline-4">
<h4 id="org98e08f1"><span class="section-number-4">2.4.2.</span> Immutable (filter)</h4>
<div class="outline-text-4" id="text-2-4-2">
<ul class="org-ul">
<li>Removes elements by condition</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3, 4]
let newArr = arr.filter(x =&gt; x !== 3)
// [1, 2, 4]
</pre>
</div>
</div>
</div>

<div id="outline-container-org98d63de" class="outline-4">
<h4 id="org98d63de"><span class="section-number-4">2.4.3.</span> Immutable (slice + spread)</h4>
<div class="outline-text-4" id="text-2-4-3">
<ul class="org-ul">
<li>Removes element at a specific index</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3, 4]
let index = 2
let newArr = [
  ...arr.slice(0, index),
  ...arr.slice(index + 1)
]
// [1, 2, 4]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga56701f" class="outline-3">
<h3 id="orga56701f"><span class="section-number-3">2.5.</span> Performance Notes</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li><code>pop()</code> → O(1)</li>
<li><code>shift()</code> → O(n)</li>
<li><code>splice()</code> → O(n)</li>
</ul>
</div>
</div>

<div id="outline-container-org9883e13" class="outline-3">
<h3 id="org9883e13"><span class="section-number-3">2.6.</span> Notes</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Prefer <code>pop()</code> when possible for performance</li>
<li>Use <b>immutable</b> patterns for predictable state management</li>
<li>Avoid <code>shift()</code> in performance-critical paths</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd76a391" class="outline-2">
<h2 id="orgd76a391"><span class="section-number-2">3.</span> Sorting</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8267b57" class="outline-3">
<h3 id="org8267b57"><span class="section-number-3">3.1.</span> Overview</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Arrays can be reordered in place</li>
<li>Default sorting behavior is lexicographic (string-based)</li>
<li>Sorting methods are mutable unless copied first</li>
</ul>
</div>
</div>

<div id="outline-container-orgf475e4b" class="outline-3">
<h3 id="orgf475e4b"><span class="section-number-3">3.2.</span> reverse()</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Reverses the order of elements</li>
<li>Mutates the original array</li>
<li>Returns the same array reference</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
arr.reverse()
// [3, 2, 1]
</pre>
</div>
</div>

<div id="outline-container-orgf885c9a" class="outline-4">
<h4 id="orgf885c9a"><span class="section-number-4">3.2.1.</span> Immutable (copy + reverse)</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
let newArr = [...arr].reverse()
// [3, 2, 1]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc06cf62" class="outline-3">
<h3 id="orgc06cf62"><span class="section-number-3">3.3.</span> sort()</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Sorts elements in place</li>
<li>Mutates the original array</li>
<li>Returns the same array reference</li>
<li>Default behavior converts elements to strings</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [10, 2, 1]
arr.sort()
// ["1", "10", "2"]
</pre>
</div>
</div>

<div id="outline-container-org32e9be2" class="outline-4">
<h4 id="org32e9be2"><span class="section-number-4">3.3.1.</span> Numeric sort (ascending)</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-js">let arr = [10, 2, 1]
arr.sort((a, b) =&gt; a - b)
// [1, 2, 10]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0a28bd" class="outline-4">
<h4 id="orgb0a28bd"><span class="section-number-4">3.3.2.</span> Numeric sort (descending)</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-js">let arr = [10, 2, 1]
arr.sort((a, b) =&gt; b - a)
// [10, 2, 1]
</pre>
</div>
</div>
</div>

<div id="outline-container-orge077490" class="outline-4">
<h4 id="orge077490"><span class="section-number-4">3.3.3.</span> String sort</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">
<pre class="src src-js">let arr = ["banana", "apple", "cherry"]
arr.sort()
// ["apple", "banana", "cherry"]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1855df" class="outline-4">
<h4 id="orgd1855df"><span class="section-number-4">3.3.4.</span> Immutable (copy + sort)</h4>
<div class="outline-text-4" id="text-3-3-4">
<div class="org-src-container">
<pre class="src src-js">let arr = [3, 1, 2]
let newArr = [...arr].sort((a, b) =&gt; a - b)
// [1, 2, 3]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb2d080f" class="outline-3">
<h3 id="orgb2d080f"><span class="section-number-3">3.4.</span> Performance Notes</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>reverse() → O(n)</li>
<li>sort() → O(n log n)</li>
</ul>
</div>
</div>

<div id="outline-container-org62a2e36" class="outline-3">
<h3 id="org62a2e36"><span class="section-number-3">3.5.</span> Notes</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Always provide a compare function for numeric sorting</li>
<li>Use copies (`[&#x2026;arr]`) to avoid mutating original data</li>
<li>Common in UI ordering and data normalization</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge48418b" class="outline-2">
<h2 id="orge48418b"><span class="section-number-2">4.</span> Iterators</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0d6596b" class="outline-3">
<h3 id="org0d6596b"><span class="section-number-3">4.1.</span> Overview</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Iterator methods process array elements sequentially</li>
<li>Does not change array length</li>
<li>Often used for transformation and selection</li>
<li><code>map()</code> and <code>filter()</code> return new arrays (immutable)</li>
<li><code>forEach()</code> is used for side effects</li>
</ul>
</div>
</div>

<div id="outline-container-org52ae92e" class="outline-3">
<h3 id="org52ae92e"><span class="section-number-3">4.2.</span> forEach()</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Executes a function for each element</li>
<li>Does not return a value (returns undefined)</li>
<li>Cannot be chained for transformations</li>
<li>Used for side effects (logging, mutations, I/O)</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
arr.forEach(x =&gt; {
  console.log(x)
})
</pre>
</div>

<ul class="org-ul">
<li>Example: mutating external state</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">let sum = 0
arr.forEach(x =&gt; {
  sum += x
})
// sum = 6
</pre>
</div>
</div>
</div>

<div id="outline-container-org69e4c79" class="outline-3">
<h3 id="org69e4c79"><span class="section-number-3">4.3.</span> map()</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Transforms each element</li>
<li>Returns a <b>new</b> array of the same length</li>
<li>Does <b>not</b> mutate the original array</li>
<li>Chainable</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3]
let doubled = arr.map(x =&gt; x * 2)
// [2, 4, 6]
</pre>
</div>

<ul class="org-ul">
<li>Mapping to objects</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">let users = ["alice", "bob"]
let result = users.map(name =&gt; ({ name }))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8a6143" class="outline-3">
<h3 id="orge8a6143"><span class="section-number-3">4.4.</span> filter()</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Selects elements based on a condition</li>
<li>Returns a new array (length ≤ original)</li>
<li>Does <b>not</b> mutate the original array</li>
<li>Chainable</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3, 4]
let evens = arr.filter(x =&gt; x % 2 === 0)
// [2, 4]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5f5e58" class="outline-3">
<h3 id="orgc5f5e58"><span class="section-number-3">4.5.</span> Chaining Example</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-js">let arr = [1, 2, 3, 4, 5]
let result = arr
  .filter(x =&gt; x % 2 !== 0)
  .map(x =&gt; x * 10)
// [10, 30, 50]
</pre>
</div>
</div>
</div>

<div id="outline-container-org331f2a4" class="outline-3">
<h3 id="org331f2a4"><span class="section-number-3">4.6.</span> Performance Notes</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>forEach() → O(n)</li>
<li>map() → O(n)</li>
<li>filter() → O(n)</li>
</ul>
</div>
</div>

<div id="outline-container-org7befc39" class="outline-3">
<h3 id="org7befc39"><span class="section-number-3">4.7.</span> Notes</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>Use <code>forEach()</code> for side effects only</li>
<li>Prefer <code>map()</code> for transformation</li>
<li>Prefer <code>filter()</code> for selection</li>
<li>Avoid using <code>forEach()</code> when a return value is required</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org70326c5" class="outline-2">
<h2 id="org70326c5"><span class="section-number-2">5.</span> Two-Dimensional Array Iteration</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd6880ea" class="outline-3">
<h3 id="orgd6880ea"><span class="section-number-3">5.1.</span> Overview</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>A <b>two-dimensional</b> array is an array of arrays</li>
<li>Often represents grids, matrices, or tables</li>
<li>Can be iterated <b>row-wise</b> or <b>column-wise</b></li>
<li>Typically accessed as <code>matrix[row][col]</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgd3cbbc9" class="outline-3">
<h3 id="orgd3cbbc9"><span class="section-number-3">5.2.</span> Row-wise Iteration</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Traverse rows first, then columns</li>
<li>Most common iteration pattern</li>
<li>Preserves natural array order</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let matrix = [
  [1, 2, 3],
  [4, 5, 6],
  [7, 8, 9]
]

for (let row = 0; row &lt; matrix.length; row++) {
  for (let col = 0; col &lt; matrix[row].length; col++) {
    console.log(matrix[row][col])
  }
}
</pre>
</div>

<ul class="org-ul">
<li>Using forEach</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">matrix.forEach(row =&gt; {
  row.forEach(value =&gt; {
    console.log(value)
  })
})
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeeaff70" class="outline-3">
<h3 id="orgeeaff70"><span class="section-number-3">5.3.</span> Column-wise Iteration</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Traverse columns first, then rows</li>
<li>Useful for column-based processing</li>
<li>Assumes rectangular matrix</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">let rows = matrix.length
let cols = matrix[0].length

for (let col = 0; col &lt; cols; col++) {
  for (let row = 0; row &lt; rows; row++) {
    console.log(matrix[row][col])
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org803c891" class="outline-3">
<h3 id="org803c891"><span class="section-number-3">5.4.</span> Column-wise with forEach</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-js">let cols = matrix[0].length

for (let col = 0; col &lt; cols; col++) {
  matrix.forEach(row =&gt; {
    console.log(row[col])
  })
})
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3dc10b" class="outline-3">
<h3 id="orgb3dc10b"><span class="section-number-3">5.5.</span> Notes</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>Row-wise is cache-friendly and most common</li>
<li>Column-wise requires consistent row lengths</li>
<li>Always check matrix dimensions before column-wise access</li>
<li>Useful in algorithms, grids, and game boards</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
